/** 
 * 이미지 파일 띄워쓰기 없애는 코드
 * 실행은 node.js로 한다.
 * 명령어 node filename_changer.js 
 */

const fs = require("fs");
const path = require("path");
const dir = path.join(__dirname, "/docs/.vuepress/public/assets/demos/");
const rs = fs.readdirSync(dir);
rs.forEach(file =>
  fs.renameSync(path.join(dir, file), path.join(dir, file.replace(/\s/g, "")))
);
// rs.forEach(file => console.log(file.replace(/\s/g, "")));

/**
1.행안부로고.jpg
10.민주주의서울찾아가는시민제안어린이대공원편.PNG
11.제안관리관리자화면.jpg
12.민주주의서울주요시민제안모니터링.jpg
13.민주주의서울시민토론보건소에서도난임주사를맞을수있다면어떨까요.PNG
14.민주주의서울시민토론길고양이와의공존을위해우리는무엇을해야할까요.PNG
15.민주주의서울열린토론회재개발,재건축시길고양이보호조치를만들면어떨까요.PNG
16.민주주의서울실험장서울역일일야학.PNG
17.시민토론보건소에서도난임주사를맞을수있다면어떨까요결과콘텐츠.PNG
18.민주주의서울서울시가묻습니다주요기관제안.jpg
19.서울시가묻습니다공공기관화장실에무료생리대를비치하면어떨까요.png
2.서울특별시빠띠로고.PNG
20.서울시가묻습니다3일이상미세먼지비상저감조치발령시의무차량2부제시행어떻게생각하시나요.PNG
21.민주주의서울열린토론회거주자우선주차장,같이쓰면어떨까요.PNG
22.시민의견분석리포트걱정없이아이를키울수있는서울,어떻게만들까요.jpg
23.민주주의서울서울시가묻습니다결과콘텐츠.PNG
24.민주주의서울디자인가이드.PNG
25.민주주의서울공식페이스북.PNG
26.민주주의서울공식인스타그램.PNG
27.시민제안워크숍참여독려이메일.PNG
28.민주주의서울페이스북이벤트민주주의서울을찾아라.PNG
29.민주주의서울지하철,버스,전광판광고.PNG
3.민주주의서울프로세스(변경전).jpg
30.서울시동주민센터배포용포스터.jpg
31.서울시내부용서울시가묻습니다가이드.jpg
32.민주주의서울엽서형태의홍보물제작및배포.PNG
33.민주주의서울페이스북카드뉴스게시글.PNG
34.민주주의서울홍보키네틱영상.PNG
35.민주주의서울이용가이드영상.PNG
36.민주주의서울어린이보호구역에피소드영상.PNG
37.민주주의서울워크숍시민제안가들중도입국청소년편스케치영상.PNG
38.민주주의서울발전전략.PNG
4.민주주의서울프로세스(변경후).jpg
5.해외플랫폼의답변기준.PNG
6.민주주의서울답변기준.jpg
7.시민협력가및주제테이블소개카드뉴스.PNG
8.민주주의서울시민제안워크숍서울제안가들행사사진.PNG
9.민주주의서울찾아가는시민제안시민깜짝기자회견.PNG
 */